<html>
<head>
<title>Untitled Document</title>
</head>
















<body bgcolor="#FFFFFF">
<BLOCKQUOTE>












<table width="75%" border="0">















<tr> 















  <td> 















    <div align="left"><font face="Default" size="2"><a href="toc.html"><b>Sommaire</b></a></font></div>















  </td>















  <td> 















    <div align="left"><font face="Default" size="2"><a href="overview.html"><b>Pr&eacute;sentation</b></a></font></div>















  </td>















  <td bgcolor="#FFFFFF"> 















    <div align="left"><font face="Default" size="2"><b><a href="menu.html">Menus</a></b></font></div>















  </td>















  <td> 















    <div align="left"><font face="Default" size="2"><b><a href="windows.html">Fen&ecirc;tres</a></b></font></div>















  </td>















  <td> 















    <div align="left"><font face="Default" size="2"><b><a href="button.html">Boutons</a></b></font></div>















  </td>















</tr>












</table>
<h2><b><font color="#0000A0">Menu Fichier</font></font></b> 
</h2>












<table width="90%" border="1" cellpadding="5" cellspacing="0" name="mrenus" bordercolorlight="#999999" bordercolor="#999999">















<tr> 















  <td width="24%" height="26"> 















    <h5 align="left">OPTION</font></h5>















  </td>















  <td width="76%" height="26"> 















    <h5 align="left">DESCRIPTION</font></h5>















  </td>















</tr>















<tr> 















  <td width="24%" valign="top"> 















    <div align="left"><font color="#000099"><b><font color="#000000" face="Default" size="2">Lire fichier batch</font></b></font></div>















  </td>















  <td width="76%"> 















    <p align="left"><font face="Default" size="2">Cette option permet d'ex&eacute;cuter des fichiers batch pr&eacute;par&eacute;s. Selon l'&eacute;tat d&eacute;fini dans l'onglet <a href="inputoptions.html">Options de la fen&ecirc;tre de saisie</a>, il est possible de lire un fichier dans la fen&ecirc;tre de saisie, de le modifier, puis de l'ex&eacute;cuter en cliquant sur le <a href="button.html">bouton Soumettre</a> ou en s&eacute;lectionnant l'option <i>Ex&eacute;cuter</i> du <a
href="query.html">menu Requ&ecirc;te</a>. <i></i>Le <i> d&eacute;limiteur de ligne de commande</i> peut &ecirc;tre d&eacute;fini dans l'onglet <a
href="inputoptions.html">Options de la fen&ecirc;tre de saisie</a>.</font></p>















    <p align="left"><font face="Default" size="2"> Pour ex&eacute;cuter le fichier batch en arri&egrave;re-plan, en mode non d&eacute;taill&eacute;, il suffit de cocher l'option correspondante dans l'onglet <a
href="inputoptions.html">Options de la fen&ecirc;tre de saisie</a>.</font></p>















  </td>















</tr>















<tr> 















  <td width="24%"><b><font face="Default" size="2">Enregistrer la fen&ecirc;tre de saisie dans un fichier</font></b></td>















  <td width="76%"><font face="Default" size="2">Cette option enregistre le contenu courant de la fen&ecirc;tre de saisie dans un fichier. Vous pourrez ensuite le lire et ex&eacute;cuter les donn&eacute;es qu'il contient.</font></td>















</tr>















<tr> 















  <td width="24%" valign="top"><b><font size="2" face="Default">Enregistrer le buffer de r&eacute;sultats dans un fichier</font></b></td>















  <td width="76%">















    <p><font face="Default" size="2">Chaque jeu de r&eacute;sultats est stock&eacute; dans un buffer de r&eacute;sultats. Cette option permet donc d'enregistrer le contenu de ce buffer dans un fichier. Il est ainsi facile d'enregistrer les donn&eacute;es stock&eacute;es dans la base. Si ces donn&eacute;es sont pr&eacute;sent&eacute;es sous forme de <i>Table</i>, utilisez l'onglet <a href="outputoptions.html">Options de la fen&ecirc;tre de r&eacute;sultats</a> pour d&eacute;finir le d&eacute;limiteur de champ. Vous pouvez ainsi pr&eacute;parer le fichier de r&eacute;sultats avec la commande <b>bcp</b> afin de relire ult&eacute;rieurement les donn&eacute;es dans une table de base de donn&eacute;es. Le d&eacute;limiteur est toujours <i> LineFeed</i>. </font></p>















    <p><font face="Default" size="2">Si les donn&eacute;es sont affich&eacute;es sous forme de <i>Texte</i>, elles sont stock&eacute;es telles qu'elles apparaissent dans la fen&ecirc;tre de r&eacute;sultats.</font></p>















  </td>















</tr>















<tr> 















  <td width="24%" valign="top"><b><font face="Default" size="2">Enregistrer le buffer d'historique dans un fichier</font></b></td>















  <td width="76%"><font face="Default" size="2">Chaque commande ex&eacute;cut&eacute;e est enregistr&eacute;e dans le buffer de l'historique qui s'affiche lorsque vous cliquez sur le bouton <a href="button.html">Historique</a>. Vous pouvez modifier le contenu de ce buffer (par exemple, ajouter des commentaires) et l'enregistrer dans un fichier journal qui aidera le Support Technique &agrave; reproduire des pannes, le cas &eacute;ch&eacute;ant.</font></td>















</tr>















<tr> 















  <td width="24%" valign="top"><b><font face="Default" size="2">Imprimer le style ASCII des jeux de r&eacute;sultats</font></b></td>















  <td width="76%">















    <p><font face="Default" size="2">Cette option envoie le jeu de r&eacute;sultats courant &agrave; une imprimante. Les donn&eacute;es sont alors pr&eacute;sent&eacute;es sous forme de texte ASCII.</font></p>















    <p><font face="Default" size="2" color="#800000"><b>REMARQUE : </b></font><font face="Default" size="2"> Si vous modifiez les donn&eacute;es dans la fen&ecirc;tre de saisie (par exemple en redimensionnant ou en r&eacute;organisant les colonnes), ces modifications n'apparaissent pas sur le document imprim&eacute;.</font></p>















  </td>















</tr>















<tr> 















  <td width="24%" valign="top"><b><font face="Default" size="2">Imprimer les jeux de r&eacute;sultats dans le style JTable</font></b> <font face="Default" size="2"><br> (jdk 1.2 uniquement)</font></td>















  <td width="76%">















    <p><font size="2" face="Default">Cette option envoie le jeu de r&eacute;sultats courant &agrave; une imprimante. Les donn&eacute;es sont pr&eacute;sent&eacute;es sous forme de <a href="table.html">JTable</a> avec rendu.</font> </p>















    <p><font face="Default" size="2" color="#800000"><b>REMARQUE : </b></font><font face="Default" size="2"> Si vous modifiez les donn&eacute;es dans la fen&ecirc;tre de saisie (par exemple en redimensionnant ou en r&eacute;organisant les colonnes), ces modifications n'apparaissent pas dans le document imprim&eacute;.</font></p>















  </td>















</tr>















<tr> 















  <td width="24%" valign="top"><b><font face="Default" size="2">Quitter</font></b></td>















  <td width="76%"><font face="Default" size="2">Cette option ferme toutes les fen&ecirc;tres de session (ce qui met fin &eacute;galement aux connexions &agrave; la base de donn&eacute;es) ainsi que l'application. </font></td>















</tr>












</table>












<hr>
<table width="75%" border="0">












<tr> 















<td> 















  <div align="center"><font face="Default" size="2"><a href="toc.html"><b>Sommaire</b></a></font></div>















</td>















<td> 















  <div align="center"><font face="Default" size="2"><a href="overview.html"><b>Pr&eacute;sentation</b></a></font></div>















</td>















<td bgcolor="#FFFFFF"> 















  <div align="center"><font face="Default" size="2"><b><a href="menu.html">Menus</a></b></font></div>















</td>















<td> 















  <div align="center"><font face="Default" size="2"><b><a href="windows.html">Fen&ecirc;tres</a></b></font></div>















</td>















<td> 















  <div align="center"><font face="Default" size="2"><b><a href="button.html">Boutons</a></b></font></div>















</td>












</tr>
</table>
</BLOCKQUOTE>
<p>&nbsp;</p>
</body>
</html>
