<HTML>
<BODY bgcolor="#FFFFFF">
<BLOCKQUOTE>



<table width="75%" border="0">



  <tr> 



    <td> <font face="Default" size="2"><a href="toc.html"><b>Sommaire</b></a></font> 



    </td>



    <td> <font face="Default" size="2"><a href="overview.html"><b>Pr&eacute;sentation</b></a></font> 



    </td>



    <td bgcolor="#FFFFFF"> <font face="Default" size="2"><b><a href="menu.html">Menus</a></b></font> 



    </td>



    <td> <font face="Default" size="2"><b><a href="windows.html">Fen&ecirc;tres</a></b></font> 



    </td>



    <td> <font face="Default" size="2"><b><a href="button.html">Boutons</a></b></font> 



    </td>



  </tr>



</table>
<hr>



<h2><font face="Default" color="#000099">Colonnes de type image</font></h2>



<p><font face="Default" size="2">Lorsque vous s&eacute;lectionnez des donn&eacute;es qui incluent une image, une colonne de type image appara&icirc;t et le jeu de r&eacute;sultats s'affiche dans une table plut&ocirc;t que dans une zone de texte (<A
HREF="table.html">R&eacute;sultats au format table ou texte</A>) ; la colonne de type image n'affiche pas les donn&eacute;es binaires. La table porte le libell&eacute; &quot;Cliquez ici - je suis une image&quot;. </font></p>



<p><font face="Default" size="2">Si vous cliquez sur cette cellule, une nouvelle fen&ecirc;tre appara&icirc;t, proposant quatre options : </font> </p>



<ul>



  <li> <font face="Default" size="2"><b>Afficher les donn&eacute;es image en tant qu'image</b>. Si les donn&eacute;es repr&eacute;sentent une image au format gif ou jpg, celle-ci appara&icirc;t dans une fen&ecirc;tre. </font> 



  <li> <font face="Default" size="2"><b>Afficher les donn&eacute;es image au format hexad&eacute;cimal</b>. Cette option ouvre une fen&ecirc;tre qui affiche les donn&eacute;es au format hexad&eacute;cimal, comme elles appara&icirc;traient sous <b>isql</b>. </font> 



  <li> <font face="Default" size="2"><b>Enregistrer les donn&eacute;es image dans un fichier</b>. Les donn&eacute;es sont enregistr&eacute;es dans un fichier en vue d'un traitement ult&eacute;rieur. Cette option est utile par exemple pour lire un fichier audio ou vid&eacute;o dans un autre programme. </font> 



  <li> <font face="Default" size="2"><b>Ne rien faire</b>. Ferme la fen&ecirc;tre des options. </font> </ul>



<h2><font color="#000099">Colonnes de type objet</font></font></h2>



<p><font size="2" face="Default">Si un jeu de r&eacute;sultats contient une ou plusieurs colonnes avec des objets java, le texte appara&icirc;t dans la table du jeu de r&eacute;sultats avec le libell&eacute; &quot;Cliquez ici - je suis un objet&quot;. Lorsque vous cliquez, <b>jisql</b> ex&eacute;cute la m&eacute;thode <b>toString()</b> d&eacute;finie dans cet objet et pr&eacute;sente les valeurs renvoy&eacute;es par la m&eacute;thode sous la forme d'une table. Si l'objet utilise une m&eacute;thode autre que <b> toString()</b> pour afficher ses donn&eacute;es, entrez son nom dans l'onglet <a href="outputoptions.html">Options de la fen&ecirc;tre de r&eacute;sultats</a> de la fen&ecirc;tre des options, ce qui revient &agrave; </font><font size="2" face="Default">remplacer la mention &quot;M&eacute;thode utilis&eacute;e dans l'objet DB pour afficher les donn&eacute;es&quot; par le nom de la m&eacute;thode &agrave; utiliser. </font></p>



<p><font size="2" face="Default">Si l'option &quot;Extraire automatiquement les donn&eacute;es de l'objet Java&quot; est activ&eacute;e, <b>jisql</b> extrait imm&eacute;diatement les donn&eacute;es lorsqu'il d&eacute;tecte des objets Java dans le jeu de r&eacute;sultats. Dans ce cas, le message &quot;Cliquez ici&quot; n'appara&icirc;t pas et aucun clic n'est n&eacute;cessaire pour recevoir les donn&eacute;es. Ce processus ralentit la cr&eacute;ation de la table du jeu de r&eacute;sultats car <b>jisql</b> doit parcourir toute la base de donn&eacute;es ligne par ligne afin d'ex&eacute;cuter la m&eacute;thode <b>toString()</b> (ou une m&eacute;thode &eacute;quivalente) de l'objet.</font> </p>



<hr>



<table width="75%" border="0">



  <tr> 



    <td> <font face="Default" size="2"><a href="toc.html"><b>Sommaire</b></a></font> 



    </td>



    <td> <font face="Default" size="2"><a href="overview.html"><b>Pr&eacute;sentation</b></a></font> 



    </td>



    <td bgcolor="#FFFFFF"> <font face="Default" size="2"><b><a href="menu.html">Menus</a></b></font> 



    </td>



    <td> <font face="Default" size="2"><b><a href="windows.html">Fen&ecirc;tres</a></b></font> 



    </td>



    <td> <font face="Default" size="2"><b><a href="button.html">Boutons</a></b></font> 



    </td>



  </tr>



</table>
</BLOCKQUOTE>
</BODY>
</HTML>




