<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
























































<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
























































<meta name="GENERATOR" content="Mozilla/4.51 [en] (X11; U; SunOS 5.6 sun4u) [Netscape]">
























































<title>Aide sur jisql</title>
</head>
<body text="#000000" bgcolor="#FFFFFF">
































































<blockquote>&nbsp;
<table BORDER=0 WIDTH="75%" >
<tr>
<td><b><font size=-1><a href="toc.html" target="_top">Sommaire</a></font></font></b></td>
































































<td BGCOLOR="#CCCCCC"><b><font size=-1>Pr&eacute;sentation</font></font></b></td>
































































<td><b><font size=-1><a href="menu.html">Menus</a></font></font></b></td>
































































<td><b><font size=-1><a href="windows.html">Fen&ecirc;tres</a></font></font></b></td>
































































<td><b><font size=-1><a href="button.html">Boutons</a></font></font></b></td>
</tr>
</table>
































































<hr>
<h2>
<font color="#000099">Pr&eacute;sentation</font></font></h2>
<font color="#000000"><font size=-1><b>jisql</b> est un &eacute;diteur Transact-SQL facile &agrave; utiliser, qui vous aide &agrave; :</font></font></font> <ul>
<li>
<font color="#000000"><font size=-1>Composer des instructions de commande T-SQL avec une interface utilisateur graphique</font></font></font></li>
































































<li> 
<font color="#000000"><font size=-1>Ex&eacute;cuter des requ&ecirc;tes T-SQL</font></font></font></li>
































































<li>
<font color="#000000"><font size=-1>Visualiser les r&eacute;sultats des requ&ecirc;tes au format texte ou table</font></font></font></li>
































































<li>
<font size=-1>E<font color="#000000">nregistrer les donn&eacute;es entr&eacute;es ou les r&eacute;sultats dans des fichiers de formats courants, faciles &agrave; importer dans d'autres applications (par exemple, Microsoft Excel ou <b>bcp</b>)</font></font></font></li>
</ul> <font color="#000000"><font size=-1>Enti&egrave;rement &eacute;crit en Java, <b>jisql</b> tire parti des JFC (Java Foundation Classes) de Swing.</font></font></font>
<p><font color="#000000"><font size=-1><b>jisql</b> est intuitif et suppose que vous &ecirc;tes d&eacute;j&agrave; familiaris&eacute; avec Transact-SQL et les serveurs de bases de donn&eacute;es Sybase.</font></font></font>
<p><font size=-1>La fen&ecirc;tre de connexion contient des <a href="button.html">boutons et des listes de s&eacute;lection</a>, la <a href="input.html">fen&ecirc;tre de saisie</a>, la <a href="output.html">fen&ecirc;tre de r&eacute;sultats</a>, la <a href="status.html">fen&ecirc;tre d'&eacute;tat</a> et le <a href="menu.html">menu</a> amovible. Il est possible de redimensionner la hauteur de chaque fen&ecirc;tre en faisant glisser &agrave; l'aide de la souris la ligne horizontale qui les s&eacute;pare.</font></font>
<p><font size=-1><b>jisql </b>supporte des jeux de caract&egrave;res cod&eacute;s sur plusieurs octets pour afficher les donn&eacute;es dans diff&eacute;rentes polices. Vous devez v&eacute;rifier que l'environnement de votre ordinateur est correctement d&eacute;fini. Par exemple, sous UNIX, vous devez faire particuli&egrave;rement attention aux variables d'environnement LC_CTYPE et LANG. V&eacute;rifiez &eacute;galement que les polices que vous souhaitez utiliser sont bien install&eacute;es sur votre machine.</font>
<p><font size=-1><b>jisql </b>supporte Input Method Framework, qui permet de taper un texte dans la fen&ecirc;tre de saisie en chinois, en japonais ou en cor&eacute;en (langues qui utilisent des milliers de caract&egrave;res diff&eacute;rents) sur un clavier &agrave; caract&egrave;res latins. Pour plus d'informations, reportez-vous &agrave; la page Web <a href="http://java.sun.com/products//jdk/1.3/docs/guide/imf/overview.html">Input Method Framework Overview</a> de Sun Microsystem.</font>
<p><font color="#000000"><font size=-1>Vous pouvez faire part de vos critiques ou de vos souhaits au forum jConnect, &agrave; l'adresse suivante :</font></font></font> <ul>
<li>
<font color="#000000"><font size=-1>news://forums.sybase.com/sybase.public.jconnect40</font></font></font></li>
































































<li>
<font color="#000000"><font size=-1>news://forums.sybase.com/sybase.public.jconnect50</font></font></font></li>
</ul>
































































<hr>
<table BORDER=0 WIDTH="75%" >
<tr>
<td><b><font size=-1><a href="toc.html" target="_top">Sommaire</a></font></font></b></td>
































































<td BGCOLOR="#CCCCCC"><b><font size=-1>Pr&eacute;sentation</font></font></b></td>
































































<td><b><font size=-1><a href="menu.html">Menus</a></font></font></b></td>
































































<td><b><font size=-1><a href="windows.html">Fen&ecirc;tres</a></font></font></b></td>
































































<td><b><font size=-1><a href="button.html">Boutons</a></font></font></b></td>
</tr>
</table>
</blockquote>
































































</body>
</html>
