<html>
<head>
<title>Untitled Document</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>
































<body bgcolor="#FFFFFF">
<blockquote> 
























<table width="75%" border="0">






























<tr> 































 <td width="30%"> 































   <div align="left"><font face="Default" size="2"><a href="toc.html"><b>Sommaire</b></a></font></div>































 </td>































 <td width="22%"> 































   <div align="left"><font face="Default" size="2"><a href="overview.html"><b>Pr&eacute;sentation</b></a></font></div>































 </td>































 <td bgcolor="#FFFFFF" width="14%"> 































   <div align="left"><font face="Default" size="2"><b><a href="menu.html">Menus</a></b></font></div>































 </td>































 <td width="18%"> 































   <div align="left"><font face="Default" size="2"><b><a href="windows.html">Fen&ecirc;tres</a></b></font></div>































 </td>































 <td width="16%"> 































   <div align="left"><font face="Default" size="2"><b><a href="button.html">Boutons</a></b></font></div>































 </td>






























</tr>
























</table>
























<hr>
























<h2><font face="Default" color="#000099">Saisie et ex&eacute;cution de requ&ecirc;tes</font></h2>
























<p><font face="Default" size="2">Un fichier batch (ou script) est un ensemble d'instructions Transact-SQL utilis&eacute; pour ex&eacute;cuter une t&acirc;che. Les scripts, stock&eacute;s sous forme de fichiers, constituent un point de d&eacute;part pour la plupart des projets d'applications serveur. La d&eacute;finition des tables, des index et des proc&eacute;dures stock&eacute;es ainsi que les rapports et les jobs batch sont g&eacute;n&eacute;ralement enregistr&eacute;s dans des fichiers script.</font></p>
























<p><font face="Default" size="2">Une fois  que vous avez &eacute;tabli une connexion avec un serveur, cliquez sur la liste d&eacute;roulante des bases de donn&eacute;es et choisissez le nom de la base que vous voulez utiliser. Vous pouvez entrer des requ&ecirc;tes de diverses mani&egrave;res. Pour ex&eacute;cuter une requ&ecirc;te, cliquez sur le bouton <font color="#000099"><b>Soumettre</b></font> de la barre d'outils ou s&eacute;lectionnez Ex&eacute;cuter la requ&ecirc;te dans le menu Requ&ecirc;te.</font></p>
</blockquote>
<ul>
























<li><font face="Default" size="2">Tapez directement votre requ&ecirc;te dans la<a href="input.html"> fen&ecirc;tre de saisie</a>, puis cliquez sur <font color="#000099"><b>Soumettre.</b></font> <br> </font></li>
























<li><font face="Default" size="2">S&eacute;lectionnez une option dans le <a href="list.html">menu Liste</a></font>. 






























<dl> 































 <dt><font face="Default" size="2"><b><font color="#990099">Si la liste affiche les tables utilisateur ou syst&egrave;me,</font></b> cliquez sur le nom d'une table ou d'une colonne puis sur <font color="#000099"><b>S&eacute;lectionner</b></font>. 































   <font color="#000000">Pour s&eacute;lectionner plusieurs noms non contigus, maintenez la touche Contr&ocirc;le enfonc&eacute;e et cliquez sur chaque nom &agrave; inclure dans la s&eacute;lection. Pour s&eacute;lectionner plusieurs noms contigus, maintenez la touche Majuscules enfonc&eacute;e et cliquez sur les premier et dernier noms de la s&eacute;lection. <b>jisql</b></font> ins&egrave;re une instruction <B>select</B> pour les tables ou les colonnes choisies dans la fen&ecirc;tre de saisie.</font> <br>































 </dt>































 <dt><font face="Default" size="2"><font color="#990099"><b>Si les proc&eacute;dures stock&eacute;es ou les triggers sont affich&eacute;s,</b></font> cliquez sur le nom de l'&eacute;l&eacute;ment &agrave; afficher puis sur <font color="#000099"><b>Afficher texte</b></font>. 































   Une fen&ecirc;tre appara&icirc;t pour afficher le texte de la proc&eacute;dure stock&eacute;e ou du trigger. 































   Si vous souhaitez utiliser une partie du texte dans une requ&ecirc;te, s&eacute;lectionnez celui-ci, appuyez sur <b> <font color="#000099">Ctrl+c</font></b>, placez votre curseur dans la fen&ecirc;tre de saisie et appuyez sur <b><font color="#000099">Ctrl+v</font></b>. <b>jisql</b> ins&egrave;re le texte copi&eacute; dans la fen&ecirc;tre (pour certains gestionnaires de fen&ecirc;tres uniquement).</font></dt>






























</dl>
























</li>
























<li><font face="Default" size="2">S&eacute;lectionnez une requ&ecirc;te pr&eacute;c&eacute;dente dans la fen&ecirc;tre de saisie et cliquez sur <b><font color="#000099">Soumettre</font></b> ou s&eacute;lectionnez Ex&eacute;cuter la requ&ecirc;te dans le menu Requ&ecirc;te.<br> </font></li>
























<li><font face="Default" size="2">Transf&eacute;rez des instructions de la <a href="history.html">fen&ecirc;tre d'historique</a> vers la fen&ecirc;tre de saisie (vous devez avoir ex&eacute;cut&eacute; au moins une instruction ou un batch pour que la fen&ecirc;tre de l'historique s'affiche.)</font> 






























<p><font face="Default" size="2">Cliquez sur l'ic&ocirc;ne Historique <img src="window.jpg" width="25" height="25" border="1">. Dans la fen&ecirc;tre de l'historique, s&eacute;lectionnez la ou les instructions &agrave; ex&eacute;cuter, puis cliquez sur <font color="#000099"><b>Soumettre</b></font> dans la barre des boutons de la fen&ecirc;tre de connexion. Vous pouvez aussi appuyer sur <font color="#000099"><b>Ctrl+c</b></font> pour copier des instructions de la fen&ecirc;tre de l'historique, puis sur <font color="#000099"><b>Ctrl+v</b></font> pour les coller dans la fen&ecirc;tre de saisie. </font></p>
























</li>
</ul>
<blockquote> 
























<p><font face="Default" size="2">Les jeux de r&eacute;sultats s'affichent dans la <a href="output.html">fen&ecirc;tre de r&eacute;sultats</a>.</font></p>
























<hr>
























<table width="106%" border="0">






























<tr> 































 <td width="32%"> 































   <div align="left"><font face="Default" size="2"><a href="toc.html"><b>Sommaire</b></a></font></div>































 </td>































 <td width="21%"> 































   <div align="left"><font face="Default" size="2"><a href="overview.html"><b>Pr&eacute;sentation</b></a></font></div>































 </td>































 <td width="14%"> 































   <div align="left"><font face="Default" size="2"><b><a href="menu.html">Menus</a></b></font></div>































 </td>































 <td width="18%"> 































   <div align="left"><font face="Default" size="2"><b><a href="windows.html">Fen&ecirc;tres</a></b></font></div>































 </td>































 <td width="15%"> 































   <div align="left"><font face="Default" size="2"><b><a href="button.html">Boutons</a></b></font></div>































 </td>






























</tr>
























</table>
</blockquote>
</body>
</html>
